tutorials/multiphaseTransport/interTransportFoam/channelMultiphaseTransport/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices        
(
    (0 0 0)//0
    (0.0008 0 0)//1
    (0.0008 0.00005 0)//2
    (0 0.00005 0)//3
    (0 0 1e-6)//4
    (0.0008 0 1e-6)//5
    (0.0008 0.00005 1e-6)//6
    (0 0.00005 1e-6)//7
);

blocks          
(
        hex (0 1 2 3 4 5 6 7) (200 16 1) simpleGrading 
	(
	1
        (	
	    (32 50 4)(68 50 1)
	)
        1
	)
);

edges           
(
);

boundary
(
    top 
    {
        type symmetryPlane;
        faces
        (
	    (3 7 6 2)
	);
    }

    bottom
    {
        type walls;
        faces
        (	
	    (0 1 5 4)
        );
    }
    inlet
    {
		type patch;
		faces
		(
	    	(0 4 7 3)
		);
    } 
    outlet
    {
		type patch;
		faces
		(
	   	(1 2 6 5)
		);
    }
    frontandback
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
