tutorials/multiphaseTransport/interTransportFoam/channelMultiphaseTransport/system/setFieldsDict1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.phase1 0
    volScalarFieldValue Species 0 
);

regions
(
    boxToCell
    {
        box (x1 y1 0) (x2 y2 1e-4);
        fieldValues
        (
            volScalarFieldValue alpha.phase1 1
            volScalarFieldValue Species 1 
        );
    }
);


// ************************************************************************* //
